{"movie":"The Super Mario Bros. Movie","reviews":[{"rating":7,"helpful":272,"title":"Illumination's best since Despicable Me 1.","review":"Granted, this film is not going to appeal to people who have never been fans of any games featuring the titular brothers. But given the fact that these filmmakers were tasked with making a movie that caters to a fan base that spans four decades and thus have a myriad of tastes and expectations, they did a pretty good job. In fact, a slightly better job than I was expecting. The voice cast was the subject of much controversy, and I thought that for the most part it was actually spot-on. A couple of characters were horribly miscast in my opinion, but in particular Jack Black as Bowser and Charlie Day as Luigi shine as perfectly encapsulating the spirit of the characters. Platforming elements from the games was very efficiently worked into the action sequences, and some of them were quite thrilling. This is easily Illumination's most visually stunning film, and a massive step up from every one of their other films since the first Despicable Me. As for the plot, it's just the plot of every Mario game. And for the most part, that's all it needs to be. Every beat plays out almost exactly like you'd expect it to, with a couple subversions pleasantly thrown in there. The messiest parts of the movie, if I'm going to get critical, are the dialogue (which is often quite stupid) and the characters. They just try to deal with too many of them, and although four or five characters are strongly introduced with background and desires, almost none of these introductions actually amount to a payoff, and even when there is a payoff, it's haphazardly thrown together for a rushed ending. Although I think 85-90 minutes is actually the perfect length for an animated film normally, this one could've benefitted from an extra 10-20 minutes to flesh out these points a bit more. We move so quickly from location to location that there's never any time to breathe or get invested. But that's my adult perspective. I had a pretty breezy, fun, and heartwarming time, though I would've liked more meat on the script. My theater was PACKED, and probably 75% young children, and they all seemed to have the time of their lives. Your kids will probably love it, and you will probably more than tolerate it."},{"rating":10,"helpful":427,"title":"An absolute BLAST!","review":"First off this movie is for kids and fans of Nintendo and the Mario franchise. I still think an adult who isnt a fan could still enjoy it but this movie is so full of fan service that it will have you smiling the whole time. The voice acting I was skeptical but they all work and work well too. Jack Black is the star here. I love how they kept the story simple like all of the games. Truly felt like a video game on screen. This movie felt like a beautifully animated amusement park ride. The audio in the movie was amazing too. The sounds and the score with reimagined iconic music was perfect. Some of the songs in the movie felt unnecessary but they worked. I think they should've bumped the run time to 105-120 min. 90 min felt too short as it goes by quick. I havent had this much wholesome fun at the movies in a long time. If youre a fan you HAVE to see it."},{"rating":10,"helpful":205,"title":"Chris Pratt was awesome as Mario and Jack black as bowser was remarkable!!!!!!","review":"After meeting Chris Pratt at the Santa Barbara film festival I'm very amazed of how remarkable Chris played Mario for the first. I remember playing Mario kart double dash on GameCube 20 years ago with my sister during Christmas Day and I absolutely loved the game . Universal and Nintendo did a great job making this movie for kids and adults who played the video game since the 80s 90s 2000s to now . The Mario movie was absolutely awesome and very creative from the video game . Chris was absolutely hilarious as Mario . Jack black as bowser was the best for the film. His voice was a mixture of Vader which I find so outstanding. Chris who voiced Mario did a fantastic job. He used the characters voice very carefully. The sounds were just like the video game. And i think that was absolutely awesome. The story taking place in New York to the mushroom kingdom is brilliant. Princess peach was the best part of the movie . She had a good way of showing bowser she will not marry a turtle . And toad was the best part of the movie . The rest of the characters including donkey Kong voiced by Seth rogen was so awesome. I hope in the next Mario movie yoshi finds Mario and Luigi and becomes they're pet."},{"rating":8,"helpful":192,"title":"Everyone is so fixated on rotten tomatoes scores, it really is a solid film","review":"I am someone who is not swayed by \"critics\" or rotten tomato scores. I didn't even really have any expectations going into this movie. As someone who grew up playing Super Mario Bros, Super Mario World etc., I was really just going to see this movie based on nostalgia and it does deliver on nostalgia. The visuals are stunning, and while everyone has their reservations about Chris Pratt the voice acting is perfect (except one for one elderly character). While many have said this movie moves quickly or \"too fast\", I would say it has great pacing and never leaves you bored. While it is not a perfect film it leaves little to be desired. It is everything you want from an animated Super Mario Movie."},{"rating":10,"helpful":122,"title":"Brilliant animation and portrayal of the super Mario bros!","review":"Took my kids for a special sky screening and boy were we excited! At first I was rather skeptical thinking this film won't do any justice to the games. However, I was wrong! This film met our expectation and beyond. I think I enjoyed this film more than my kids. From the moment the film starts it is enjoyable. Good sense of humour and a lot of nice scenes. A lot of laughable moments. Apart from the film being too short it still met my expectations. As a 39 year old who played all the Mario games since childhood, this bought back a lot of fond memories of sleepless nights of playing the Mario games. A must watch film whether you have kids or not."},{"rating":7,"helpful":102,"title":"Critics are being too harsh for what it is","review":"I think for what this movie sets out to do, Super Mario Bros. Movie pretty much ticks the boxes of an entertaining, reference fan-service heavy movie. A lot of the jokes are basic sure, but it's just impressive that there is some competency to a Video Game Movie. Sometimes simple and straightforward is the best way to go. Not high art or anything, but it ticks off almost everything for what Mario should be at least. Voice acting wasn't as bad as I thought, and Jack Black was the highlight as expected. Yeah, not gonna win any big awards but judge it for what it is, and yeah by Video Game Movie standards it's one of the best ones easily if you ask me."},{"rating":6,"helpful":23,"title":"pretty much as expected","review":"Mario (Chris Pratt) and Luigi (Charlie Day) are struggling Brooklyn brother plumbers. When the city's sewer goes haywire, Mario sees an opportunity for heroic fame. Instead, they get sucked into an alternate world. The brothers get separated. Mario joins Princess Peach (Anya Taylor-Joy) to recruit the Kong army in their fight against the evil turtle Bowser (Jack Black). Luigi gets captured. It's brightly colored. It's energetic. It's got the characters. There's the game play. The story is fairly simple. It's pretty much what I expected. I wish there is more heart to it. The brothers could have been that, but they get separated pretty quickly. I played some of the games over the years and this will probably appeal to the fans. It's got all the brightly colored chaos for the kids. It's less so for everybody else."},{"rating":7,"helpful":156,"title":"The Message Of Love Is Sent Directly To The Fanbase, Not To The General Audience.","review":"This is a movie that feels like a love letter to all the Nintendo fans out there, even if they don't necessarily play Mario anymore. The film delivers a fun and enjoyable experience for viewers by faithfully adapting every aspect of the game into the movie, including the Mario Kart and Donkey Kong franchises. The movie is packed with non-stop action and fast-paced storytelling, leaving little room for some of the more significant elements that fans might have wanted to see. It may not be able to fulfill every fan's wishes, but it's understandable and sets up for a sequel, as there is a post-credits scene. But for general audiences who are not familiar with Mario enough, this might be a movie that is difficult to understand. There may be questions like why does it have to be like this? Why do it this way? Why is the world so strange? This is because the story hardly explains in detail for us to know how the world is. Even though the story is simple and has nothing much. But if you don't think too much, it's an easy and enjoyable movie to watch, with the lovable characters in the style of the works from the studio that made Despicable Me."},{"rating":9,"helpful":103,"title":"The Mario movie is a great, nostalgic animated film","review":"The Mario Movie is great! If you are a fan of Nintendo, then you will have a blast. It is sprinkled with a plethora of references and call backs. The voice acting is superb! You can let your reservations on Chris Pratt pass as he is great in this movie. Anya Taylor-Joy brings an optimistic spirit, Charlie Day is good and Seth Rogen is good. But the best by far was Jack Black!! He stole the show. Especially when he sings a certain song! The animation was fantastic. It baffles me how realistic looking they can make everything. Based off of certain parts of the movie, it looks like there will be a sequel on some point, and I'm excited."},{"rating":10,"helpful":57,"title":"Everything you can ask for in a Mario Bros movie.","review":"5 out of 5 stars. The Super Mario Bros movie is an awesome animated adventure film that is one of the best adaptation of a video game series. It has everything you can ask for. Its like an open world of nintendo game series like Donkey Kong making an appearance. The film is fast paced. The plot is good. It has a story about the bros. The film features a lot of easter eggs that can hint for more movies. The action sequences are awesome. Bowser is an awesome villain. The animation is beautifully done and stunning. The voice talent is also great. One of the best sequences involving a mario kart chase on a rainbow road is insane. Fans and kids will love the series and love how everything is put together in this film. Overall, i love everything about the film. I can not wait for more."},{"rating":8,"helpful":136,"title":"Movie not took take seriously","review":"Some people are taking this movie too seriously. This movie is just supposed to be fun and colorful and not to be taken like a tarantino movie or something. Of course the plot could be improved a bit here and there but it's actually a really fun and entertaining movie when you just enjoy the ride. If you're a big fan of Mario you will absolutely love this movie 100%. I felt like a little kid again when i saw all the characters and easter eggs in every scene. The animation was insanely well done and i believe they could've made the movie a bit longer to expand on the world a bit more and get to know each character more but that's about it."},{"rating":9,"helpful":139,"title":"Don't listen to the critics on rotten tomatoes, this movie is really good.","review":"As a Mario fan myself it was a very enjoyable and fun action packed movie. While watching I just couldn't wipe the smile off my face. Jack black did an amazing job with voice acting bowser. Everyone did a great job and while I do agree Chris Pratt could have been better i got use to it really quick and im sure pretty much everyone else will too and besides, the Italian accent in the games is great but definitely not meant for a 80 minute movie. The plot is very simple which is good however because a Mario story shouldn't be complex at all and the people at illumination definitely know how the games should be. Speaking of that, you can tell the people behind this movie put a lot of heart into it. Definitely give this a strong recommendation if you like Mario or have childhood memories with Mario in any way or just wanna watch an enjoyable family movie."},{"rating":8,"helpful":42,"title":"So much fun","review":"This movie is so much damn fun and I absolutely loved everything about it. The composing in this movie is some of the best I've ever heard and it fit so well in the movie. The voice acting was pretty good too and I didn't think Chris Pratt would be any good as Mario but he was actually pretty good but Jack Black stole the show as Bowser as he absolutely killed his role. Charlie Day was great too as Luigi as he was probably my 2nd favorite in the movie. The only problem I have with this movie is it felt so quick and I wish it was longer and it's only 90 minutes. Other than that this movie is just a ton of fun and worth the watch."}]}